{
    "JOB_TITLE": "Big Data Engineer",
    "JOB_TAGLINE": "Programmeer met hart en hoofd",
    "JOB_CLIENT_CASE": "Pyeongchang, Zuid-Korea - 2018. De wereld volgt de Olympische Winterspelen. Skiën, schaatsen en bobsleeën; alles wordt online gestreamd. Ook door een groot Amerikaans tv-netwerk. Gracenote- en Codestar-engineers bouwen aan het nieuwe platform om deze livestreams te verrijken met real-time data van tussentijden, fictieve standen, video logs, en biografieën van sporters. Via real-time stream processing-technologieën als Kafka en Akka. Voor een gouden plak in kijkbeleving.",
    "JOB_PARAGRAPHS": [
        {
            "title": "Daarom bij Codestar",
            "content": "Big, fast & smart data. Wij blinken uit in real-time dataplatforms en reactive apps. Door te programmeren. Met hart en hoofd. In multidisciplinaire, agile teams. Zonder formele toestanden. Gewoon met elkaar, maximaal waarde halen uit big data. Waarom wij daar zó sterk in zijn? Door onze continuous learning-cultuur waarin jouw ontwikkeling centraal staat. Met R&D-dagen, Campus fridays en weekenden met internationale topcoaches. Welkom. Wij zijn het #1-bedrijf voor Full Stack Scala en Fast Data-oplossingen."
        },
        {
            "title": "Wie ben jij?",
            "content": "Wij zoeken teamspelers. Gepassioneerd en leergierig. Professionals die de verschillende talen in een multidisciplinair team spreken. Die met hun Scala-skills of krachtige Java-background de steeds grotere big data-golven willen bedwingen. En de ambitie hebben om samen met collega’s een real-time datawereld te creëren waar de maatschappij écht iets aan heeft. Fast. Reactive. Stream processing.",
            "list": [
                "Hbo-/wo-denkniveau",
                "Polyglot programmeur (Scala, Java, Python, ...)",
                "Kennis van Spark, Kafka, Hadoop, Cassandra, SQL, ElasticSearch, Airflow",
                "Ervaring met gedistribueerde systemen, microservices, databases en NoSQL technologieën"
            ]
        }
    ]
}
