{
    "JOBS_CLIENT_CASE_LABEL": "Klantcase",
    "JOBS_CONTACT_BUTTON": "Mail Ons",
    "JOBS_COMMON_PARAGRAPHS": [
        {
            "title": "Dit verdien je",
            "content": "We doen er alles aan om jouw groei optimaal te ondersteunen. Zodat je master kunt worden in jouw vakgebied.",
            "list": [
                "Nieuwste Macbook of Microsoft Surface: bepaal zelf hoe je werkt",
                "R&D dagen in Nieuwegein: focus op thema’s waarin jij expert wil worden",
                "Campus fridays: werk op kantoor met collega’s die je helpen als je vastloopt én je inspireren met hun projecten en code",
                "1 buitenlandse topconferentie: voor de inspiratie om voorop te lopen",
                "2 Codecamps per jaar met toptrainers: in de woonkamer van een vakantiewoning, omdat we dan zelf bepalen wanneer de cursusdag is afgelopen en de strand-BBQ daarna meteen kan beginnen",
                "Vast contract: ons commitment voor jouw groei naar master"
            ]
        },
        {
            "title": "Meer weten",
            "content": "Meer weten over Codestar? Dat vertellen we graag persoonlijk. Dus als je er voor open staat om ons beter te leren kennen, neem dan deel aan een van onze trainingen of evenementen. Die organiseren we regelmatig en zijn voor iedereen kosteloos toegankelijk. Of maak gewoon een afspraak. Mail gerust onze business unit manager"

        }
    ],
    "JOBS_NOTES": [
        "Acquisitie naar aanleiding van deze vacature wordt niet op prijs gesteld."
    ],
    "JOBS_SHARE_BUTTON": "Deel",
    "JOBS_LEARN_MORE_BUTTON": "Kijken",
    "JOBS_TITLE": "Hierom wil jij voor ons programmeren",
    "JOBS_ARGUMENTS": [
        "Wij durven het hardop te zeggen: wij zijn heel, heel goed",
        "Hoe we werken, bepalen we zelf",
        "Wij zijn nooit uitgeleerd",
        "Wij kennen de onderliggende principes van functioneel programmeren",
        "Wij kennen de onderliggende principes van object geörienteerd programmeren",
        "Wij delen onze passie op evenementen en internationale conferenties"
    ],
    "JOBS_VACANCIES": "Vacatures",
    "JOBS_VACANCIES_TEXT": "Meer weten over hoe het is om bij Codestar te werken? Lees de vacatures of neem contact op om eens langs te komen bij één van onze meetups of bijvoorbeeld een Campus Friday.",
    "JOBS_BEST_TECH": "Wij gebruiken de beste technologieën",
    "JOBS_BEST_CLIENTS": "Wij werken met innovatieve bedrijven",
    "JOBS_ABOUT_US": "Je weet het nog niet zeker? Leer meer over ons"
}
