{
    "JOB_TITLE": "Junior Scala Developer",
    "JOB_TAGLINE": "Programming with heart and mind",
    "JOB_CLIENT_CASE": "We’re looking for a Scala talent for our greenfield project in the port of Rotterdam. Someone who wants to join our team making a difference at Rotterdam Logistics Lab - the port’s innovation incubator. By realising real-time data streams with functional programming, reactive streams, cloud native and machine learning. Via Scala, Play, Akka, Kafka, Spark, RX, Angular2 and React. Will you be the new expert in the Scala ecosystem?",
    "JOB_PARAGRAPHS": [
        {
            "title": "Why with Codestar",
            "content": "You will work with back-end stream-processing, learn reactive front-end programming and go on trips into the world of Big Data. In a team focused on fast and streaming data. You’ll do this through programming with heart and mind for clients who want to take the next step. In a corporate culture driven by continuous learning, teamwork and programming. With R&D days, Campus Fridays and team weekends with top international coaches. Become a part of the #1 company for Full Stack Scala and Fast Data solutions in the Netherlands."
        },
        {
            "title": "Who are you?",
            "content": "We’re looking for team players who are passionate and keen to learn. Juniors who program even in their free time, because they’re curious. Juniors who want to make the difference by coming up with ground-breaking ideas. Who go for results, but never at the expense of quality. And who are not afraid to make mistakes. Because innovation is all about trial and error. Functional. Reactive. Full Stack.",
            "list": [
                "Academic mindset",
                "Experience in functional programming, Scala or Haskell"
            ]
        },
        {
            "title": "This is what you earn",
            "content": "We will do everything we can to optimise your growth. So you can become a master in your field.",
            "list": [
                "Latest Macbook or Microsoft Surface: you decide how you want to work",
                "R&D days in Nieuwegein: focus on topics you want to become an expert in",
                "Campus Fridays: work in an office with colleagues who will help you if you get stuck, and inspire you with their projects and code",
                "1 top conference abroad: for the inspiration to be a frontrunner",
                "2 Codecamps per year with top coaches: in the living room of a holiday home, so we can decide when the course day is over and the beach BBQ can begin as soon as we finish",
                "Fixed contract: our commitment to your growth to master"
            ]
        },
        {
            "title": "Find out more",
            "content": "Want to know more about our Scala home? We’d like to tell you in person. So if you want to get to know us a bit better, join one of our training sessions or events. We organise these on a regular basis and they’re open for everyone, for free. Or just make an appointment. Feel free to send our business unit manager an email"
        }
    ],
    "JOB_NOTES": [
        "We are only interested in candidates that are currently living in the Netherlands.",
        "Acquisition on the basis of this vacancy is not appreciated."
    ]
}
