{
    "JOB_TITLE": "Big Data Engineer",
    "JOB_TAGLINE": "Programming with heart and mind",
    "JOB_CLIENT_CASE": "Pyeongchang, South Korea - 2018. The world is watching the Winter Olympics. Skiing, ice skating and bobsleighing: everything is being streamed online. It’s also being broadcast by a major American TV network. Gracenote and Codestar engineers are building a new platform to enrich these live streams with real-time information of interim times, provisional standings, video logs and athletes’ biographies. And we are doing using real-time stream processing technologies, such as Kafka en Akka. For a gold medal in viewing experience.",
    "JOB_PARAGRAPHS": [
        {
            "title": "Why with Codestar",
            "content": "Big, fast & smart data. We excel in real-time data platforms and reactive apps, by programming with heart and mind in multidisciplinary, agile teams in an informal setting. Simply getting the most out of big data, together. Why do we excel at that? Because of our culture of continuous learning, in which we prioritise your development. With R&D days, Campus Fridays and weekends with top international coaches. Welcome. We are the #1 company for Full Stack Scala and Fast Data solutions in the Netherlands."
        },
        {
            "title": "Who are you?",
            "content": "We’re looking for team players who are passionate and keen to learn. Professionals who can speak the different languages in a multidisciplinary team, who want to use their Scala skills or strong Java background to tame the ever larger data waves. Professionals who have the ambition to create a real-time data world with their colleagues. Something society can really benefit from. Fast. Reactive. Stream processing.",
            "list": [
                "Academic mindset",
                "Polyglot programmer (Scala, Java, Python, ...)",
                "Knowledge of Spark, Kafka, Hadoop, Cassandra, SQL, ElasticSearch, Airflow",
                "Experience with distributed systems, microservices, databases and NoSQL technologies"
            ]
        },
        {
            "title": "This is what you earn",
            "content": "We will do everything we can to optimise your growth. So you can become a master in your field.",
            "list": [
                "Latest Macbook or Microsoft Surface: you decide how you want to work",
                "R&D days in Nieuwegein: focus on topics you want to become an expert in",
                "Campus Fridays: work in an office with colleagues who will help you if you get stuck, and inspire you with their projects and code",
                "1 top conference abroad: for the inspiration to be a frontrunner",
                "2 Codecamps per year with top coaches: in the living room of a holiday home, so we can decide when the course day is over and the beach BBQ can begin as soon as we finish",
                "Fixed contract: our commitment to your growth to master"
            ]
        },
        {
            "title": "Find out more",
            "content": "Want to know more about our Scala home? We’d like to tell you in person. So if you want to get to know us a bit better, join one of our training sessions or events. We organise these on a regular basis and they’re open for everyone, for free. Or just make an appointment. Feel free to send our business unit manager an email"
        }
    ],
    "JOB_NOTES": [
        "We are only interested in candidates that are currently living in the Netherlands.",
        "Acquisition on the basis of this vacancy is not appreciated."
    ]
}
