{
    "JOBS_CLIENT_CASE_LABEL": "Client case",
    "JOBS_CONTACT_BUTTON": "Contact Us",
    "JOBS_COMMON_PARAGRAPHS": [
        {
            "title": "This is what you earn",
            "content": "We will do everything we can to optimise your growth. So you can become a master in your field.",
            "list": [
                "Latest Macbook or Microsoft Surface: you decide how you want to work",
                "R&D days in Nieuwegein: focus on topics you want to become an expert in",
                "Campus Fridays: work in an office with colleagues who will help you if you get stuck, and inspire you with their projects and code",
                "1 top conference abroad: for the inspiration to be a frontrunner",
                "2 Codecamps per year with top coaches: in the living room of a holiday home, so we can decide when the course day is over and the beach BBQ can begin as soon as we finish",
                "Fixed contract: our commitment to your growth to master"
            ]
        },
        {
            "title": "Find out more",
            "content": "Want to know more about our Scala home? We’d like to tell you in person. So if you want to get to know us a bit better, join one of our training sessions or events. We organise these on a regular basis and they’re open for everyone, for free. Or just make an appointment. Feel free to send our business unit manager an email:"
        }
    ],
    "JOBS_NOTES": [
        "We are only interested in candidates that are currently living in the Netherlands.",
        "Acquisition on the basis of this vacancy is not appreciated."
    ],
    "JOBS_SHARE_BUTTON": "Share",
    "JOBS_LEARN_MORE_BUTTON": "Learn More",
    "JOBS_TITLE": "This is why you want to work for us",
    "JOBS_ARGUMENTS": [
        "We’re not afraid to say it out loud: We’re very, very good",
        "We decide how we work",
        "We’re never done learning",
        "We know the underlying principles of functional programming",
        "We know the underlying principles of object-oriented programming",
        "We share our passion at events and at international conferences"
    ],
    "JOBS_VACANCIES": "Vacancies",
    "JOBS_VACANCIES_TEXT": "Want to know more about what it is like to work at Codestar? Read our vacancies or contact us to to visit one of our meetups or a Campus Friday, for instance.",
    "JOBS_BEST_TECH": "We use the best technologies",
    "JOBS_BEST_CLIENTS": "We work with innovative companies",
    "JOBS_ABOUT_US": "Not sure yet? Know more about us",
    "JOBS": {
        "big_data": {
            "title": "Big Data Engineer",
            "short_description": "Dive into the world of fast and streaming data.",
            "tagline": "Programming with heart and mind",
            "client_case": "Pyeongchang, South Korea - 2018. The world is watching the Winter Olympics. Skiing, ice skating and bobsleighing: everything is being streamed online. It’s also being broadcast by a major American TV network. Gracenote and Codestar engineers are building a new platform to enrich these live streams with real-time information of interim times, provisional standings, video logs and athletes’ biographies. And we are doing using real-time stream processing technologies, such as Kafka en Akka. For a gold medal in viewing experience.",
            "paragraphs": [
                {
                    "title": "Why with Codestar",
                    "content": "Big, fast & smart data. We excel in real-time data platforms and reactive apps, by programming with heart and mind in multidisciplinary, agile teams in an informal setting. Simply getting the most out of big data, together. Why do we excel at that? Because of our culture of continuous learning, in which we prioritise your development. With R&D days, Campus Fridays and weekends with top international coaches. Welcome. We are the #1 company for Full Stack Scala and Fast Data solutions in the Netherlands."
                },
                {
                    "title": "Who are you?",
                    "content": "We’re looking for team players who are passionate and keen to learn. Professionals who can speak the different languages in a multidisciplinary team, who want to use their Scala skills or strong Java background to tame the ever larger data waves. Professionals who have the ambition to create a real-time data world with their colleagues. Something society can really benefit from. Fast. Reactive. Stream processing.",
                    "list": [
                        "Academic mindset",
                        "Polyglot programmer (Scala, Java, Python, ...)",
                        "Knowledge of Spark, Kafka, Hadoop, Cassandra, SQL, ElasticSearch, Airflow",
                        "Experience with distributed systems, microservices, databases and NoSQL technologies"
                    ]
                }
            ]
        },
        "front_end": {
            "title": "Front-End Developer",
            "short_description": "Challenging projects for JS engineers.",
            "tagline": "Programming with heart and mind",
            "client_case": "The port of Rotterdam as a greenfield project. Together with a team of Codestar colleagues, you will make a difference for the port operator in the field of front-end technology. You will do this by creating a dashboard with reactive elements, from scratch. And you and your team decide on the front-end architecture and design continuous deployment, using Angular, TypeScript, React Native, RxJs and Redux. Making Rotterdam the smartest port in the world.",
            "paragraphs": [
                {
                    "title": "Why with Codestar",
                    "content": "JavaScript: the key to single-page applications that adapt dynamically to modern users. Why we are successful in this? Because we have professional experts in functional reactive programming and smart cooperation between Front-end Developers, top players in Scala, clients and the rest of the agile team. All in an informal setting, in a culture of continuous learning that prioritises your development. With R&D days, Campus Fridays and weekends with top international coaches. Let’s become the benchmark together."
                },
                {
                    "title": "Who are you?",
                    "content": "We’re looking for team players who are passionate and keen to learn. Proactive specialists who want to prove themselves by designing and building JavaScript apps. Specialists who for results, but never at the expense of quality. And who possess good people skills, because a day is consists of more than just programming. Innovation is a team effort. It’s a matter of listening, asking questions and working together, in a multidisciplinary environment.",
                    "list": [
                        "Academic mindset",
                        "A track record in JavaScript engineering",
                        "Knowledge of functional reactive programming and/or MV* frameworks",
                        "Experience with TypeScript or other typed JavaScript variants (a big plus)"
                    ]
                }
            ]
        },
        "scala": {
            "title": "Scala Developer",
            "short_description": "Build scalable and reactive apps with us.",
            "tagline": "Programming with heart and mind",
            "client_case": "We’re looking for a Scala talent for our greenfield project in the port of Rotterdam. Someone who wants to join our team making a difference at Rotterdam Logistics Lab - the port’s innovation incubator. By realising real-time data streams with functional programming, reactive streams, cloud native and machine learning. Via Scala, Play, Akka, Kafka, Spark, RX, Angular2 and React. Will you be the new expert in the Scala ecosystem?",
            "paragraphs": [
                {
                    "title": "Why with Codestar",
                    "content": "We are creating the new world of fast and streaming data, with scalable and reactive apps that respond to complex challenges. We do this by programming with our hearts and minds. That’s how we make the difference for clients looking to take the next step. In a corporate culture driven by continuous learning, teamwork and programming. With R&D days, Campus Fridays and team weekends with top international coaches. We are the #1 company for Full Stack Scala and Fast Data solutions in the Netherlands."
                },
                {
                    "title": "Who are you?",
                    "content": "We’re looking team players who are for passionate and keen to learn. Programmers, hackers, who program even in their free time. Simply because they’re curious. Professionals who can make the difference, by coming up with ground-breaking ideas. Professionals who go for results, but never at the expense of quality. And who can also convince clients that this is the right way to go. And who are not afraid to make mistakes. Because innovation is all about trial and error. Functional. Reactive. Full Stack.",
                    "list": [
                        "Academic mindset",
                        "A track record in Scala Development"
                    ]
                }
            ]
        },
        "scala_jr": {
            "title": "Junior Scala Developer",
            "short_description": "Start with stream processing and functional programming.",
            "tagline": "Programming with heart and mind",
            "client_case": "We’re looking for a Scala talent for our greenfield project in the port of Rotterdam. Someone who wants to join our team making a difference at Rotterdam Logistics Lab - the port’s innovation incubator. By realising real-time data streams with functional programming, reactive streams, cloud native and machine learning. Via Scala, Play, Akka, Kafka, Spark, RX, Angular2 and React. Will you be the new expert in the Scala ecosystem?",
            "paragraphs": [
                {
                    "title": "Why with Codestar",
                    "content": "You will work with back-end stream-processing, learn reactive front-end programming and go on trips into the world of Big Data. In a team focused on fast and streaming data. You’ll do this through programming with heart and mind for clients who want to take the next step. In a corporate culture driven by continuous learning, teamwork and programming. With R&D days, Campus Fridays and team weekends with top international coaches. Become a part of the #1 company for Full Stack Scala and Fast Data solutions in the Netherlands."
                },
                {
                    "title": "Who are you?",
                    "content": "We’re looking for team players who are passionate and keen to learn. Juniors who program even in their free time, because they’re curious. Juniors who want to make the difference by coming up with ground-breaking ideas. Who go for results, but never at the expense of quality. And who are not afraid to make mistakes. Because innovation is all about trial and error. Functional. Reactive. Full Stack.",
                    "list": [
                        "Academic mindset",
                        "Experience in functional programming, Scala or Haskell"
                    ]
                }
            ]
        }
    }
}
