{
    "JOBS_CLIENT_CASE_LABEL": "Client case",
    "JOBS_CONTACT_BUTTON": "Contact Us",
    "JOBS_COMMON_PARAGRAPHS": [
        {
            "title": "This is what you earn",
            "content": "We will do everything we can to optimise your growth. So you can become a master in your field.",
            "list": [
                "Latest Macbook or Microsoft Surface: you decide how you want to work",
                "R&D days in Nieuwegein: focus on topics you want to become an expert in",
                "Campus Fridays: work in an office with colleagues who will help you if you get stuck, and inspire you with their projects and code",
                "1 top conference abroad: for the inspiration to be a frontrunner",
                "2 Codecamps per year with top coaches: in the living room of a holiday home, so we can decide when the course day is over and the beach BBQ can begin as soon as we finish",
                "Fixed contract: our commitment to your growth to master"
            ]
        },
        {
            "title": "Find out more",
            "content": "Want to know more about our Scala home? We’d like to tell you in person. So if you want to get to know us a bit better, join one of our training sessions or events. We organise these on a regular basis and they’re open for everyone, for free. Or just make an appointment. Feel free to send our business unit manager an email:"
        }
    ],
    "JOBS_NOTES": [
        "We are only interested in candidates that are currently living in the Netherlands.",
        "Acquisition on the basis of this vacancy is not appreciated."
    ],
    "JOBS_SHARE_BUTTON": "Share",
    "JOBS_LEARN_MORE_BUTTON": "Learn More",
    "JOBS_TITLE": "This is why you want to work for us",
    "JOBS_ARGUMENTS": [
        "We’re not afraid to say it out loud: We’re very, very good",
        "We decide how we work",
        "We’re never done learning",
        "We know the underlying principles of functional programming",
        "We know the underlying principles of object-oriented programming",
        "We share our passion at events and at international conferences"
    ],
    "JOBS_VACANCIES": "Vacancies",
    "JOBS_VACANCIES_TEXT": "Want to know more about what it is like to work at Codestar? Read our vacancies or contact us to to visit one of our meetups or a Campus Friday, for instance.",
    "JOBS_BEST_TECH": "We use the best technologies",
    "JOBS_BEST_CLIENTS": "We work with innovative companies",
    "JOBS_ABOUT_US": "Not sure yet? Know more about us"
}
